# load_services.py
from services.models import Service

data = [
    ("استخراج بطاقة هوية وطنية جديدة", "تقديم طلب للحصول على بطاقة هوية وطنية لأول مرة."),
    ("تجديد بطاقة الهوية", "خدمة لتجديد البطاقة الوطنية المنتهية."),
    ("استخراج جواز سفر جديد", "طلب إصدار جواز سفر لأول مرة."),
    ("تجديد جواز السفر", "تجديد جواز السفر السوري المنتهي."),
    ("طلب شهادة ولادة", "إصدار شهادة ولادة إلكترونية."),
    ("طلب شهادة وفاة", "خدمة تسجيل وإصدار شهادة وفاة."),
    ("طلب بيان عائلي", "استخراج بيان عائلي رسمي."),
    ("طلب شهادة زواج", "طلب إصدار أو تصديق شهادة الزواج."),
    ("طلب سجل عدلي (غير محكوم)", "استخراج ورقة غير محكوم إلكترونياً."),
    ("تسجيل مركبة جديدة", "طلب تسجيل مركبة لأول مرة."),
    ("تجديد ترخيص المركبة", "تجديد رخصة سير المركبة."),
    ("حجز موعد للمعاينة الفنية", "خدمة حجز موعد للفحص الفني للمركبات."),
    ("استخراج رخصة قيادة", "طلب رخصة قيادة للمركبات."),
    ("تجديد رخصة القيادة", "خدمة تجديد رخص القيادة."),
    ("نقل ملكية عقار", "طلب نقل ملكية العقار ضمن المصالح العقارية."),
    ("بيان قيد نفوس", "طلب إصدار بيان نفوس شخصي.")
]

for name, desc in data:
    Service.objects.get_or_create(name=name, defaults={"description": desc})

print("✅ تم تحميل جميع الخدمات بنجاح.")
